/*
YUI 3.4.1 (build 4118)
Copyright 2011 Yahoo! Inc. All rights reserved.
Licensed under the BSD License.
http://yuilibrary.com/license/
*/
YUI.add("lang/datatype-date-format_ko",function(a){a.Intl.add("datatype-date-format","ko",{"a":["�?�","월","화","수","목","금","토"],"A":["�?�요�?�","월요�?�","화요�?�","수요�?�","목요�?�","금요�?�","토요�?�"],"b":["1월","2월","3월","4월","5월","6월","7월","8월","9월","10월","11월","12월"],"B":["1월","2월","3월","4월","5월","6월","7월","8월","9월","10월","11월","12월"],"c":"%Y년 %b %d�?� %a%p %I시 %M분 %S초 %Z","p":["오전","오후"],"P":["오전","오후"],"x":"%y. %m. %d.","X":"%p %I시 %M분 %S초"});},"3.4.1");