/*
YUI 3.4.1 (build 4118)
Copyright 2011 Yahoo! Inc. All rights reserved.
Licensed under the BSD License.
http://yuilibrary.com/license/
*/
YUI.add("lang/datatype-date-format_ja",function(a){a.Intl.add("datatype-date-format","ja",{"a":["日","月","�?�","水","木","金","土"],"A":["日曜日","月曜日","�?�曜日","水曜日","木曜日","金曜日","土曜日"],"b":["1月","2月","3月","4月","5月","6月","7月","8月","9月","10月","11月","12月"],"B":["1月","2月","3月","4月","5月","6月","7月","8月","9月","10月","11月","12月"],"c":"%Y年%m月%d日(%a)%k時%M分%S秒 %Z","p":["�?��?","�?�後"],"P":["�?��?","�?�後"],"x":"%y/%m/%d","X":"%k時%M分%S秒"});},"3.4.1");